app/views/admins/movies/index.html.erb

SELECT COUNT(*) FROM `favorites` WHERE `favorites`.`movie_id` = 4
---
                <%else%>
                  <td><%= movie.favorites.count %> Favorites</td>