app/controllers/admins/comments_controller.rb

SELECT  `comments`.* FROM `comments` ORDER BY `comments`.`id` DESC LIMIT 20 OFFSET 0
---
  def index
    @comments=Comment.page(params[:page]).reverse_order.per(20)