app/controllers/admins/end_users_controller.rb

  def index
    @users=EndUser.page(params[:page]).reverse_order.per(20)
---
SELECT  `end_users`.* FROM `end_users` ORDER BY `end_users`.`id` DESC LIMIT 20 OFFSET 0