app/controllers/admins/movies_controller.rb

  def index
    @movies=Movie.page(params[:page]).reverse_order
---
SELECT  `movies`.* FROM `movies` ORDER BY `movies`.`id` DESC LIMIT 5 OFFSET 0