app/controllers/admins/tags_controller.rb

SELECT  `tags`.* FROM `tags` ORDER BY `tags`.`id` DESC LIMIT 20 OFFSET 0
---
  def index
    @tags=Tag.page(params[:page]).reverse_order