app/views/movies/index.html.erb

SELECT COUNT(*) FROM `favorites` WHERE `favorites`.`movie_id` = 1
---
              <%else%>
                <td><%= movie.favorites.count %> Favorites</td>