app/views/movies/show.html.erb

SELECT COUNT(*) FROM `favorites` WHERE `favorites`.`movie_id` = 1
---
               <%end%>
               <%= @movie.favorites.count %> Favorites</td>

SELECT `tags`.* FROM `tags` WHERE `tags`.`movie_id` = 1
---
          <p>
          <% @movie.tags.each do |tag| %>