app/views/tags/tag_search.html.erb

              <%else%>
                <td><%= tag.movie.favorites.count %> Favorites</td>
---
SELECT COUNT(*) FROM `favorites` WHERE `favorites`.`movie_id` = 2