app/views/end_users/index.html.erb

SELECT `movies`.* FROM `movies` WHERE `movies`.`end_user_id` = 1
---

        <% @end_user.movies.each do |movie| %>

SELECT COUNT(*) FROM `favorites` WHERE `favorites`.`movie_id` = 2
---
              <%else%>
                <td><%= movie.favorites.count %> Favorites</td>