app/controllers/end_users_controller.rb

SELECT  `end_users`.* FROM `end_users` WHERE `end_users`.`id` = 1 ORDER BY `end_users`.`id` ASC LIMIT 1
---
  def show
    @end_user=EndUser.find(params[:id])

SELECT  `end_users`.* FROM `end_users` WHERE `end_users`.`id` = 1 ORDER BY `end_users`.`id` ASC LIMIT 1
---
  def index
    @end_user=EndUser.find(params[:end_user_id])