app/controllers/movies_controller.rb

SELECT  `movies`.* FROM `movies` ORDER BY `movies`.`id` DESC LIMIT 5 OFFSET 0
---
  def index
    @movies=Movie.page(params[:page]).reverse_order

SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1
SELECT `songs`.* FROM `songs` WHERE `songs`.`movie_id` = 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`movie_id` = 1
---
  def show
    @movie=Movie.find(params[:id])
    @youtube_search_videos = []
    @itunes_search_songs = []
    @movie.songs.each do |song|
    @youtube_search_videos << find_videos("#{song.song} #{song.artist}")
    @itunes_search_songs << SearchClient.main("#{song.song}","#{song.artist}")
  end
    @comments=@movie.comments.all

INSERT INTO `movies` (`title`, `url`, `end_user_id`, `created_at`, `updated_at`) VALUES (' Suff Daddy Boiler Room London DJ Set', 'https://www.youtube.com/watch?v=YXFjvoU2APA', 1, '2019-09-28 09:14:30', '2019-09-28 09:14:30')
---
  def create
    @movie=Movie.new(movie_params)
    @movie.end_user_id=current_end_user.id
    @movie.save

SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 4 LIMIT 1
---
  def edit
    @movie=Movie.find(params[:id])

SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1
DELETE FROM `movies` WHERE `movies`.`id` = 1
---
  def destroy
    @movie=Movie.find(params[:id])
    @movie.destroy