app/controllers/tags_controller.rb

  def tag_search
    @tag_searches=Tag.where(['tag LIKE ?',"%#{params[:tag]}%"]).order(id: "DESC")
---
SELECT `tags`.* FROM `tags` WHERE (tag LIKE '%breakin%') ORDER BY `tags`.`id` DESC